[
  {"joke" : "I hate reading other people's code. So I wrote mine, made it as open source project, and watch others suffer."},
  {"joke" : "If I'm the Father of Open Source, it was conceived through artificial insemination using stolen sperm without my knowledge or consent."},
  {"joke" : "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."},
  {"joke" : "To iterate is human, to recurse divine."},
  {"joke" : "The trouble with programmers is that you can never tell what a programmer is doing until it's too late."},
  {"joke" : "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it."},
  {"joke" : "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves."},
  {"joke" : "Measuring programming progress by lines of code is like measuring aircraft building progress by weight."},
  {"joke" : "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code."},
  {"joke" : "I don't care if it works on your machine! We are not shipping your machine!"},
  {"joke" : "Walking on water and developing software from a specification are easy if both are frozen."},
  {"joke" : "Fine, Java MIGHT be a good example of what a programming language should be like. But Java applications are good examples of what applications SHOULDN'T be like."},
  {"joke" : "I think Microsoft named .Net so it wouldn't show up in a Unix directory listing."},
  {"joke" : "In C++ it's harder to shoot yourself in the foot, but when you do, you blow off your whole leg."},
  {"joke" : "Don't worry if it doesn't work right. If everything did, you'd be out of a job."},
  {"joke" : "Writing in C or C++ is like running a chain saw with all the safety guards removed."},
  {"joke" : "In the one and only true way. The object-oriented version of \"Spaghetti code\" is, of course, \"Lasagna code. (Too many layers)\""},
  {"joke" : "C++ : Where friends have access to your private members."},
  {"joke" : "Emacs is a great operating system, lacking only a decent editor."},
  {"joke" : "vi has two modes - \"beep repeatedly\" and \"break everything\"."},
  {"joke" : "Picasso had a saying: \"Good artists copy, great artists steal.\" We have always been shameless about stealing great ideas."},
  {"joke" : "Do everything for greatness, not money. Money follows greatness."},
  {"joke" : "God gave men both a penis and a brain, but unfortunately not enough blood supply to run both at the same time."},
  {"joke" : "Strong people don't put others down. They lift them up."},
  {"joke" : "You don't get to 500 million star systems without making a few enemies."},
  {"joke" : "A good programmer is someone who always looks both ways before crossing a one-way street."},
  {"joke" : "A cookie has no soul, it's just a cookie. But before it was milk and eggs. And in eggs there's the potential for life."},
  {"joke" : "Java is, in many ways, C++--."},
  {"joke" : "RTFM is the true path of every developer. But it would happen only if there's no way out."},
  {"joke" : "Smartphone is the best invention of 21st century for avoiding the eyes contact while crossing people you know on the street."},
  {"joke" : "Poor countries' museums vs. rich countries' museums: The first show what they have left. The second show what they have stolen."},
  {"joke" : "An opinion without 3.14 is just an onion."},
  {"joke" : "I'm not totally useless. I can be used as a bad example."},
  {"joke" : "Life is too short to remove USB safely."},
  {"joke" : "Going to McDonald's for a salad is like going to a whore for a hug."},
  {"joke" : "I need a six month holiday, TWICE A YEAR!"},
  {"joke" : "Everything is a knife if you're strong enough."},
  {"joke" : "Etc.(Abb.) End of Thinking Capacity."},
  {"joke" : "We stopped checking for monsters under our bed, when we realized they were inside us."},
  {"joke" : "I would rather check my facebook than face my checkbook."},
  {"joke" : "A better world is where chickens can cross the road without having their motives questioned."},
  {"joke" : "If I didn't drink, how would my friends know I love them at 2 AM?"},
  {"joke" : "Q: How do you generate a random string? A: Put a Windows user in front of vi, and tell him to exit."},
  {"joke" : "Never get into fights with ugly people, they have nothing to lose."},
  {"joke" : "People who say they give 110% don't really understand how percentages work."},
  {"joke" : "Never make eye contact while eating a banana."},
  {"joke" : "I love my sixpack so much, I protect it with a layer of fat."},
  {"joke" : "A programmer is told to \"go to hell\". He finds the worst part of that statement is the \"go to\"."},
  {"joke" : "An Architect's dream is an Engineer's nightmare."},
  {"joke" : "In a way, I feel sorry for the kids of this generation. They'll have parents who know how to check browser history."},
  {"joke" : "A baby's laughter is one of the most beautiful sounds you will ever hear. Unless it's 3 AM. And you're home alone. And you don't have a baby."},
  {"joke" : "It's not a bug - it's an undocumented feature."},
  {"joke" : "Should array index start at 0 or 1? My compromised solution is 0.5"},
  {"joke" : "My software never has bugs. It just develops random features."},
  {"joke" : "LISP = Lots of Irritating Silly Parentheses."},
  {"joke" : "Perl, the only language that looks the same before and after RSA encryption."},
  {"joke" : "The first 5 days after the weekend are always the hardest."},
  {"joke" : "Rhinos are just fat unicorns."},
  {"joke" : "Sometimes when I'm writing Javascript I want to throw up my hands and say \"this is bullshit!\" but I can never remember what \"this\" refers to."},
  {"joke" : "If you were born in Israel, you'd probably be Jewish. If you were born in Saudi Arabia, you'd probably be Muslim. If you were born in India, you'd probably be Hindu.But because you were born in North America, you're Christian. Your faith is not inspired by some divine, constant truth. It's simply geography."},
  {"joke" : "London 2012 Olympic Games - A bunch of countries coming across the ocean to put their flags in Britain and try to get a bunch of gold... it's like history but opposite."},
  {"joke" : "Don't be ashamed of who you are. That's your parents job."},
  {"joke" : "No, no, no, I'm not insulting you. I'm describing you."},
  {"joke" : "Your mother is so fat, the recursive function computing her mass causes a stack overflow."},
  {"joke" : "I'm not saying I am Batman, I am just saying no one has ever seen me and Batman in the same room together."},
  {"joke" : "A man without God is like a fish without a bicycle."},
  {"joke" : "I hate how spiders just sit there on the walls and act like they pay rent!"},
  {"joke" : "Governments are like diapers. They should be changed often, and for the same reason."},
  {"joke" : "I'm a creationist. I believe man created God."},
  {"joke" : "Copy from one, it's plagiarism. Copy from two, it's research."},
  {"joke" : "Race, religion, ethnic pride and nationalism etc... does nothing but teach you how to hate people that you've never met."},
  {"joke" : "Farts are just the ghosts of the things we eat."},
  {"joke" : "I promised I would never kill someone who had my blood. But that mosquito made me break my word."},
  {"joke" : "What if the spider you killed in your house had spent his entire life thinking you were his roommate? Ever think about that? No. You only think about yourself."},
  {"joke" : "Real Programmers don't comment their code. If it was hard to write, it should be hard to read."},
  {"joke" : "My neighbours listen to good music. Whether they like it or not."},
  {"joke" : "I've been using Vim for about 2 years now, mostly because I can't figure out how to exit it."},
  {"joke" : "Dear YouTube, I can deal with Ads. I can deal with Buffer. But when Ads buffer, I suffer."},
  {"joke" : "If IE is brave enough to ask you to set it as your default browser, don't tell me you dare not ask a girl out."},
  {"joke" : "When I die, I want to go peacefully like my grandfather did, in his sleep -not screaming, like the passengers in his car."},
  {"joke" : "How can you face your problem if your problem is your face?"},
  {"joke" : "Linux is user friendly. It's just picky about its friends."},
  {"joke" : "Home is where you poop most comfortably."},
  {"joke" : "To understand what recursion is, you must first understand recursion."},
  {"joke" : "Parallel lines have so much in common... It's a shame that they'll never meet."},
  {"joke" : "JavaScript is not a language. It's a programming jokes generator."},
  {"joke" : "A journalist asked Linus Torvalds what makes code bad. He replied : No comment."},
  {"joke" : "Programming in Javascript is like looking both ways before you cross the street, and then getting hit by an airplane."},
  {"joke" : "Q: Why do we need a backend, why not just connect front end to database??? A: Yeah! And why do we eat and go to the bathroom while we can throw the food directly in the toilet? Because stuff needs to get processed. ;)"},
  {"joke" : "Documentation is a love letter that you write to your future self."},
  {"joke" : "Dance like nobody's watching. Encrypt like everyone is."},
  {"joke" : "Everyone complains about the weather, but no one wants to sacrifice a virgin to change it."},
  {"joke" : "*Knock knock* \"Race condition\" \"Who's there?\""},
  {"joke" : "My biggest talent is always being able to tell what's in a wrapped present. It's a gift."},
  {"joke" : "You can't force someone to love you. But you can lock this person in the basement and wait for him/her to develop Stockholm syndrome."},
  {"joke" : "If you hold a Unix shell up to your ear, you might just be able to hear the C."},
  {"joke" : "What happened to the function that ran away? It never returned."},
  {"joke" : "When I am tasked with sorting through a stack of résumés, I throw about half of them in the garbage. I do not want unlucky people working in our company."},
  {"joke" : "The reason why we write SQL commands all in CAPITAL letters is because it stands for Screaming Query Language."},
  {"joke" : "No hugs & kisses. Only bugs & fixes."},
  {"joke" : "Don't set your password as your child's name. Name your child after your password."},
  {"joke" : "If you want to treat women as objects, do it with class."},
  {"joke" : "Someone I loved once gave me a box full of darkness. It took me years to understand that this, too, was a gift."},
  {"joke" : "If you fall, I will be there."},
  {"joke" : "In theory, there is no difference between theory and practice. But, in practice, there is."},
  {"joke" : "One man's crappy software is another man's full time job."},
  {"joke" : "Censorship is telling a man he can't have a steak just because a baby can't chew it."},
  {"joke" : "Empty your memory, with a free(), like a pointer. If you cast a pointer to a integer, it becomes the integer. If you cast a pointer to a struct, it becomes the struct. The pointer can crash, and can overflow. Be a pointer my friend."},
  {"joke" : "Uuuuuuuuuur Ahhhhrrrrrr Uhrrrr Ahhhhrrrrrr Aaaarhg..."},
  {"joke" : "No one ever makes a billion dollars. You TAKE a billion dollars."},
  {"joke" : "Wow, really 21st-century stuff you got there. As a NeoVim user I find this \"tutorial\" pathetic. Now listen up, you antiquated Emacs peasants, because I'm gonna learn you good. First off, in NeoVim, I don't need 35 plugins and a sacrifice to the GNU gods to type \"blimpy.\" Nah, man, I got that magic at my fingertips with minimal configuration. It's so easy, I don't even need a tutorial—unlike some people. By the time your Emacs even boots up, I've already typed \"blimpy,\" wrote a Python script to automate my blimpy typing, and maybe even found time to pity the Emacs users of the world. NeoVim is like the sports car of text editors, while Emacs is... well, it's like a horse-drawn carriage. Historical, but not exactly a speed demon! It was a good try but NeoVim will always be superior text editor for your blimpy needs."},
  {"joke" : "Oh I forgot I can't read Kanji."}
]
  
